
const 速記記号一覧 = {
    "あ": "&#xF7A0;",
    "い": "&#xF7A1;",
    "う": "&#xF7A2;",
    "え": "&#xF7A3;",
    "お": "&#xF7A4;",

    "か": "&#xF7A5;",
    "き": "&#xF7A6;",
    "く": "&#xF7A7;",
    "け": "&#xF7A8;",
    "こ": "&#xF7A9;",

    "さ": "&#xF7AA;",
    "し": "&#xF7AB;",
    "す": "&#xF7AC;",
    "せ": "&#xF7AD;",
    "そ": "&#xF7AE;",

    "た": "&#xF7AF;",
    "ち": "&#xF7B0;",
    "つ": "&#xF7B1;",
    "て": "&#xF7B2;",
    "と": "&#xF7B3;",

    "な": "&#xF7B4;",
    "に": "&#xF7B5;",
    "ぬ": "&#xF7B6;",
    "ね": "&#xF7B7;",
    "の": "&#xF7B8;",

    "は": "&#xF7B9;",
    "ひ": "&#xF7BA;",
    "ふ": "&#xF7BB;",
    "へ": "&#xF7BC;",
    "ほ": "&#xF7BD;",

    "ま": "&#xF7BE;",
    "み": "&#xF7BF;",
    "む": "&#xF7C0;",
    "め": "&#xF7C1;",
    "も": "&#xF7C2;",

    "や": "&#xF7C3;",
    "ゆ": "&#xF7C4;",
    "よ": "&#xF7C5;",

    "ら": "&#xF7C6;",
    "り": "&#xF7C7;",
    "る": "&#xF7C8;",
    "れ": "&#xF7C9;",
    "ろ": "&#xF7CA;",

    "わ": "&#xF7CB;",
    "ゐ": "&#xF7CC;",
    "ゑ": "&#xF7CD;",
    "を": "&#xF7CE;",

    "ぱ": "&#xF7CF;",
    "ぴ": "&#xF7D0;",
    "ぷ": "&#xF7D1;",
    "ぺ": "&#xF7D2;",
    "ぽ": "&#xF7D3;",

    "きゃ": "&#xF7D4;",
    "きゅ": "&#xF7D5;",
    "きょ": "&#xF7D6;",

    "くぁ": "&#xF7D7;",
    "くぃ": "&#xF7D8;",
    "くぇ": "&#xF7D9;",
    "くぉ": "&#xF7DA;",

    "しゃ": "&#xF7DB;",
    "しゅ": "&#xF7DC;",
    "しぇ": "&#xF7DD;",
    "しょ": "&#xF7DE;",

    "ちゃ": "&#xF7DF;",
    "ちゅ": "&#xF7E0;",
    "ちぇ": "&#xF7E1;",
    "ちょ": "&#xF7E2;",

};
