
// MEMO
// 「濁音」「を」「ん」「伸ばし棒」はなし
// font-size: 1.5rem;で6文字が限界っぽい
// 3~6文字で問題を作る

// todo 100問くらい 25 25 25 25
const 問題あ系 = [
    "なまこ",
];

// todo 30門くらい 7 8 7 8 
const 問題ぱ行 = [
    // 3文字
    "",
    "",
    "",
    "",
    "",
    "",
    "",

    // 4文字
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",

    // 5文字
    "ぱれすちな",
    "",
    "",
    "",
    "",
    "",
    "",

    // 6文字
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
];

// todo 60問くらい 15 15 15 15
const 問題きゃ系 = [];

// todo 15問くらい 3 4 4 4
const 問題ぴゃ行 = [];

function 問題(needぱ行 = true, needきゃ系 = true) {
    
}

