
// MEMO
// 「濁音」「を」「ん」「伸ばし棒」「っ」「ぁぃぅぇぉ」はなし
// font-size: 1.5rem;で6文字が限界っぽい
// 3~6文字で問題を作る
// とりま、その文字を含む単語を5つずつ作る方針

const 問題あ系 = [
    // あ
    "こあら",
    "ありがとう",
    "あさひ",
    "ひあり",
    "あいさつ",

    // い
    "いのしし",
    "たいよう",
    "ういるす",
    "さいふ",
    "すいか",

    // う
    "ういろう",
    "うちわ",
    "くうこう",
    "ふくろう",
    "うくらいな",

    // え
    "えいかいわ",
    "えいせい",
    "えいよう",
    "えほうまき",
    "いすらえる",

    // お
    "おあしす",
    "おたふく",
    "おやつ",
    "いろおに",
    "おたから",

    // か
    "いか",
    "かたかな",
    "かかおまめ",
    "かるた",
    "もえかす",

    // き
    "いきもの",
    "きらきら",
    "きいろ",
    "きこり",
    "きのこのやま",

    // く
    "くりすます",
    "くりおね",
    "くま",
    "かまくら",
    "まくら",

    // け
    "けむし",
    "けとる",
    "けにあ",
    "けいさつ",
    "みけねこ",

    // こ
    "こるく",
    "みるくここあ",
    "こうこうせい",
    "こいこい",
    "こあくま",

    // さ
    "さしみ",
    "さる",
    "さるもねら",
    "さかなや",
    "やさい",

    // し
    "しすてむ",
    "しまうま",
    "くらし",
    "しいたけ",
    "あしすと",

    // す
    "すまほ",
    "すいす",
    "すきる",
    "あいす",
    "たこす",

    // せ
    "せいかつ",
    "きのせい",
    "せせらわらう",
    "せかいへいわ",
    "かわせみ",

    // そ
    "そうなのか",
    "かわいそう",
    "そふと",
    "そつなく",
    "きそくせい",

    // た
    "たぬき",
    "あきた",
    "たこらいす",
    "たたり",
    "おおあたり",

    // ち
    "ちくわ",
    "ちけい",
    "かちかちやま",
    "あちらこちら",
    "ほちきす",

    // つ
    "つわもの",
    "ついすと",
    "きつつき",
    "もちつき",
    "つきみ",

    // て
    "てとら",
    "てぬき",
    "みてくれ",
    "てきはつ",
    "てにす",

    // と
    "とまらない",
    "といち",
    "とらいある",
    "かなしいとき",
    "とこや",

    // な
    "なまこ",
    "なまえ",
    "なないろ",
    "なきむし",
    "なくしもの",

    // に
    "ほしにく",
    "にこにこ",
    "あにさきす",
    "ほにほに",
    "",

    // ぬ
    "",
    "",
    "",
    "",
    "",

    // ね
    "",
    "",
    "",
    "",
    "",

    // の
    "",
    "",
    "",
    "",
    "",

    // は
    "",
    "",
    "",
    "",
    "",

    // ひ
    "",
    "",
    "",
    "",
    "",

    // ふ
    "",
    "",
    "",
    "",
    "",

    // へ
    "",
    "",
    "",
    "",
    "",

    // ほ
    "",
    "",
    "",
    "",
    "",

    // ま
    "",
    "",
    "",
    "",
    "",

    // み
    "",
    "",
    "",
    "",
    "",

    // む
    "",
    "",
    "",
    "",
    "",

    // め
    "",
    "",
    "",
    "",
    "",

    // も
    "",
    "",
    "",
    "",
    "",

    // や
    "",
    "",
    "",
    "",
    "",

    // ゆ
    "",
    "",
    "",
    "",
    "",

    // よ
    "",
    "",
    "",
    "",
    "",

    // ら
    "",
    "",
    "",
    "",
    "",

    // り
    "",
    "",
    "",
    "",
    "",

    // る
    "",
    "",
    "",
    "",
    "",

    // れ
    "",
    "",
    "",
    "",
    "",

    // ろ
    "",
    "",
    "",
    "",
    "",

    // わ
    "",
    "",
    "",
    "",
    "",
];

const 問題ぱ行 = [
    // ぱ
    "ぱれすちな",
    "はらぺこ",
    "ぱらだいす",
    "すぱい",
    "ぱぱ",

    // ぴ
    "ぴあの",
    "ぴかぴか",
    "かぴかぴ",
    "ひえぴた",
    "ぴかそ",
    
    // ぷ
    "ぷらすしこう",
    "ぷかぷか",
    "ぷりくら",
    "えいぷりる",
    "ぎぷす",
    
    // ぺ
    "ぺこぺこ",
    "えうろぺ",
    "ぺるみ",
    "ぺるそな",
    "こぴぺ",

    // ぽ
    "あぽろ",
    "えぽな",
    "かかぽ",
    "くてのぽま",
    "ぽとふ",
];

const 問題きゃ系 = [
    // きゃ
    "",
    "",
    "",
    "",
    "",

    // きゅ
    "やきゅう",
    "きゅうたい",
    "",
    "",
    "",

    // きょ
    "",
    "",
    "",
    "",
    "",

    // しゃ
    "",
    "",
    "",
    "",
    "",

    // しゅ
    "",
    "",
    "",
    "",
    "",

    // しょ
    "",
    "",
    "",
    "",
    "",

    // ちゃ
    "",
    "",
    "",
    "",
    "",

    // ちゅ
    "",
    "",
    "",
    "",
    "",

    // ちょ
    "",
    "",
    "",
    "",
    "",

    // にゃ
    "",
    "",
    "",
    "",
    "",

    // にゅ
    "",
    "",
    "",
    "",
    "",

    // にょ
    "",
    "",
    "",
    "",
    "",

    // ひゃ
    "",
    "",
    "",
    "",
    "",

    // ひゅ
    "",
    "",
    "",
    "",
    "",

    // ひょ
    "",
    "",
    "",
    "",
    "",

    // みゃ
    "みゃくみゃく",
    "",
    "",
    "",
    "",

    // みゅ
    "",
    "",
    "",
    "",
    "",

    // みょ
    "",
    "",
    "",
    "",
    "",

    // りゃ
    "",
    "",
    "",
    "",
    "",

    // りゅ
    "",
    "",
    "",
    "",
    "",

    // りょ
    "",
    "",
    "",
    "",
    "",
];

const 問題ぴゃ行 = [
    // ぴゃ
    "ぴゅあ",
    "",
    "",
    "",
    "",

    // ぴゅ
    "",
    "",
    "",
    "",
    "",

    // ぴょ
    "",
    "",
    "",
    "",
    "",
];

function 問題生成(needぱ行 = true, needきゃ系 = true) {
    // todo

    const text = Array.from(問題あ系[randomInt(問題あ系.length)]);
    const mondai = [];

    for (let i = 0; i < text.length; i++) {
        // 最後のindexではない かつ 次の文字が「ゃゅょ」の場合
        if (i < text.length - 1 && /^(ゃ|ゅ|ょ)$/.test(text[i + 1])) {
            mondai.push(text[i] + text[i + 1]);
            i++; // ひとつ進める
            continue;
        }
        mondai.push(text[i]);
    }

    return mondai;
}

