
// MEMO
// 「濁音」「を」「ん」「伸ばし棒」はなし
// font-size: 1.5rem;で6文字が限界っぽい
// 3~6文字で問題を作る

// todo 500問くらい 130 120 130 120
const 問題あ系 = [
    "なまこ",
];

// todo 50門くらい 13 12 13 12
const 問題ぱ行 = [
    // 3文字
    "うぱす",
    "あなぱ",
    "かるぱ",
    "さぱた",
    "さるぱ",
    "たこぱ",
    "",
    "",
    "",
    "",
    "",
    "",
    "",

    // 4文字
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",

    // 5文字
    "ぱれすちな",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",

    // 6文字
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
];

// todo 100問くらい 25 25 25 25
const 問題きゃ系 = [];

// todo 15問くらい 4 4 4 3
const 問題ぴゃ行 = [];

function 問題(needぱ行 = true, needきゃ系 = true) {
    
}

