
// MEMO
// 「濁音」「を」「ん」「伸ばし棒」「ぁぃぅぇぉ」はなし
// font-size: 1.5rem;で6文字が限界っぽい
// 3~6文字で問題を作る
// とりま、その文字を含む単語を5つずつ作る方針

const 問題あ系 = [
    "なまこ",
];

const 問題ぱ行 = [
    "ぱれすちな",
    "はらぺこ",
    "ぱらだいす",
    "すぱい",
    "ぱぱ",

    "ぴあの",
    "ぴかぴか",
    "かぴかぴ",
    "ひえぴた",
    "ぴかそ",
    
    "ぷらすしこう",
    "ぷかぷか",
    "ぷりくら",
    "ぷぺる",
    "ぎぷす",
    
    "ぺこぺこ",
    "えうろぺ",
    "ぺるみ",
    "ぺるそな",
    "こぴぺ",

    "あぽろ",
    "えぽな",
    "かかぽ",
    "くてのぽま",
    "ぽとふ",
];

const 問題きゃ系 = [];

const 問題ぴゃ行 = [
    "ぴゅあ",
];

function 問題(needぱ行 = true, needきゃ系 = true) {
    
}

