
// MEMO
// 「濁音」「を」「ん」「伸ばし棒」「ぁぃぅぇぉ」はなし
// font-size: 1.5rem;で6文字が限界っぽい
// 3~6文字で問題を作る
// とりま、その文字を含む単語を5つずつ作る方針

const 問題あ系 = [
    // あ
    "こあら",
    "ありがとう",
    "あさひ",
    "ひあり",
    "あいさつ",

    // い
    "いのしし",
    "たいよう",
    "ういるす",
    "さいふ",
    "すいか",

    // う
    "ういろう",
    "うちわ",
    "くうこう",
    "ふくろう",
    "うくらいな",

    // え
    "えいかいわ",
    "えいせい",
    "えいよう",
    "えほうまき",
    "いすらえる",

    // お
    "おあしす",
    "おたふく",
    "おやつ",
    "いろおに",
    "おたから",

    "なまこ",
];

const 問題ぱ行 = [
    // ぱ
    "ぱれすちな",
    "はらぺこ",
    "ぱらだいす",
    "すぱい",
    "ぱぱ",

    // ぴ
    "ぴあの",
    "ぴかぴか",
    "かぴかぴ",
    "ひえぴた",
    "ぴかそ",
    
    // ぷ
    "ぷらすしこう",
    "ぷかぷか",
    "ぷりくら",
    "えいぷりる",
    "ぎぷす",
    
    // ぺ
    "ぺこぺこ",
    "えうろぺ",
    "ぺるみ",
    "ぺるそな",
    "こぴぺ",

    // ぽ
    "あぽろ",
    "えぽな",
    "かかぽ",
    "くてのぽま",
    "ぽとふ",
];

const 問題きゃ系 = [];

const 問題ぴゃ行 = [
    "ぴゅあ",
];

function 問題生成(needぱ行 = true, needきゃ系 = true) {
    // todo

    const text = Array.from(問題あ系[randomInt(問題あ系.length)]);
    const mondai = [];

    for (let i = 0; i < text.length; i++) {
        // 最後のindexではない かつ 次の文字が「ゃゅょ」の場合
        if (i < text.length - 1 && /^(ゃ|ゅ|ょ)$/.test(text[i + 1])) {
            mondai.push(text[i] + text[i + 1]);
            i++; // ひとつ進める
            continue;
        }
        mondai.push(text[i]);
    }

    return mondai;
}

